---
kind: type
id: T:Autodesk.Revit.DB.FabricationServiceSettings
source: html/74134cf4-2874-3b29-5e0f-b4cd7b852ae9.htm
---
# Autodesk.Revit.DB.FabricationServiceSettings

Represents the settings related to the fabrication services.

## Syntax (C#)
```csharp
public class FabricationServiceSettings : Element
```